import pandas as pd

df1 = pd.read_csv('110-1.csv',usecols=['交易日期','行政區','交易標的種類','代表建號屋齡','房地總價','幾房','幾廳','幾衛','車位數量','代表建號層次','土地移轉面積','建物移轉面積','車位總持分面積'])
df2 = pd.read_csv('110-2.csv',usecols=['交易日期','行政區','交易標的種類','代表建號屋齡','房地總價','幾房','幾廳','幾衛','車位數量','代表建號層次','土地移轉面積','建物移轉面積','車位總持分面積'])
df3 = pd.read_csv('110-3.csv',usecols=['交易日期','行政區','交易標的種類','代表建號屋齡','房地總價','幾房','幾廳','幾衛','車位數量','代表建號層次','土地移轉面積','建物移轉面積','車位總持分面積'])
df4 = pd.read_csv('110-4.csv',usecols=['交易日期','行政區','交易標的種類','代表建號屋齡','房地總價','幾房','幾廳','幾衛','車位數量','代表建號層次','土地移轉面積','建物移轉面積','車位總持分面積'])
df5 = pd.read_csv('111-1.csv',usecols=['交易日期','行政區','交易標的種類','代表建號屋齡','房地總價','幾房','幾廳','幾衛','車位數量','代表建號層次','土地移轉面積','建物移轉面積','車位總持分面積'])
df6 = pd.read_csv('111-2.csv',usecols=['交易日期','行政區','交易標的種類','代表建號屋齡','房地總價','幾房','幾廳','幾衛','車位數量','代表建號層次','土地移轉面積','建物移轉面積','車位總持分面積'])
df7 = pd.read_csv('111-3.csv',usecols=['交易日期','行政區','交易標的種類','代表建號屋齡','房地總價','幾房','幾廳','幾衛','車位數量','代表建號層次','土地移轉面積','建物移轉面積','車位總持分面積'])
df8 = pd.read_csv('111-4.csv',usecols=['交易日期','行政區','交易標的種類','代表建號屋齡','房地總價','幾房','幾廳','幾衛','車位數量','代表建號層次','土地移轉面積','建物移轉面積','車位總持分面積'])
df9 = pd.read_csv('112-1.csv',usecols=['交易日期','行政區','交易標的種類','代表建號屋齡','房地總價','幾房','幾廳','幾衛','車位數量','代表建號層次','土地移轉面積','建物移轉面積','車位總持分面積'])
df10 = pd.read_csv('112-2.csv',usecols=['交易日期','行政區','交易標的種類','代表建號屋齡','房地總價','幾房','幾廳','幾衛','車位數量','代表建號層次','土地移轉面積','建物移轉面積','車位總持分面積'])
df11 = pd.read_csv('112-3.csv',usecols=['交易日期','行政區','交易標的種類','代表建號屋齡','房地總價','幾房','幾廳','幾衛','車位數量','代表建號層次','土地移轉面積','建物移轉面積','車位總持分面積'])
df12 = pd.read_csv('112-4.csv',usecols=['交易日期','行政區','交易標的種類','代表建號屋齡','房地總價','幾房','幾廳','幾衛','車位數量','代表建號層次','土地移轉面積','建物移轉面積','車位總持分面積'])

con = pd.concat([df1,df2,df3,df4,df5,df6,df7,df8,df9,df10,df11,df12],ignore_index=True)


con = con[con['交易標的種類']!='土地']
con = con[con['交易標的種類']!='車位']



con = con.reindex(columns=['交易日期','行政區','交易標的種類','代表建號屋齡','房地總價','幾房','幾廳','幾衛','車位數量','代表建號層次','土地移轉面積','建物移轉面積','車位總持分面積'])


#print(con.isnull().sum())



con['代表建號屋齡'] = con['代表建號屋齡'].fillna(con['代表建號屋齡'].mean())
con['幾房'] = con['幾房'].fillna(0)
con['幾廳'] = con['幾廳'].fillna(0)
con['幾衛'] = con['幾衛'].fillna(0)
con['車位數量'] = con['車位數量'].fillna(0)
con['代表建號層次'] = con['代表建號層次'].fillna(0)
con['土地移轉面積'] = con['土地移轉面積'].fillna(0)
con['建物移轉面積'] = con['建物移轉面積'].fillna(0)
con['車位總持分面積'] = con['車位總持分面積'].fillna(0)





con['房地總價'] = con['房地總價'].replace(',','',regex=True).astype("float64")
con['交易日期'] = con['交易日期'].astype("int64")
con['代表建號屋齡'] = con['代表建號屋齡'].astype("int64")
con['幾房'] = con['幾房'].astype("int64")
con['幾廳'] = con['幾廳'].astype("int64")
con['幾衛'] = con['幾衛'].astype("int64")
con['車位數量'] = con['車位數量'].astype("int64")
con['土地移轉面積'] = con['土地移轉面積'].astype("float64")
con['建物移轉面積'] = con['建物移轉面積'].astype("float64")
con['車位總持分面積'] = con['車位總持分面積'].astype("float64")





#con.to_csv('data.csv',index=False)
#print(con.isnull().sum())
#print(con.info())
#print(con)